---
kind: property
id: P:Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter.StructuralMaterialType
source: html/443d21b4-4cd1-0516-3516-e1ac07ce1e9a.htm
---
# Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter.StructuralMaterialType Property

The family structural material type.

## Syntax (C#)
```csharp
public StructuralMaterialType StructuralMaterialType { get; }
```